online/semana_4/concerts_project/app/controllers/concerts_controller.rb

SELECT "concerts".* FROM "concerts"
---
	def index
		@concerts = Concert.all

SELECT  "concerts".* FROM "concerts" WHERE "concerts"."id" = ? LIMIT 1  [["id", 1]]
---
	def show
		@concerts = Concert.find(params[:id])

INSERT INTO "concerts" ("bandName", "venue", "city", "date", "price", "description", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?)
---
	def create
		@concert = Concert.new(concert_params)

		@concerts = Concert.all
		if @concert.save

SELECT  "concerts".* FROM "concerts" WHERE "concerts"."id" = ? LIMIT 1  [["id", 5]]
DELETE FROM "concerts" WHERE "concerts"."id" = ?  [["id", 5]]
---
	def destroy
		@concert = Concert.find(params[:id])
		@concert.destroy

SELECT  "concerts".* FROM "concerts" WHERE "concerts"."id" = ? LIMIT 1  [["id", 1]]
UPDATE "concerts" SET "totalLikes" = ?, "updated_at" = ? WHERE "concerts"."id" = ?  [["totalLikes", 1], ["updated_at", "2015-05-01 18:49:10.293945"], ["id", 6]]
---
	def like
		@concert = Concert.find(params[:id])
		@concert.update_attribute(:totalLikes, @concert.totalLikes + 1)

SELECT "concerts".* FROM "concerts"  ORDER BY "concerts"."totalLikes" DESC
---
	def popularConcerts
		@concerts = Concert.order(totalLikes: :desc)

SELECT "concerts".* FROM "concerts"
---
	def allConcerts
		@concerts = Concert.all